// Лабораторная работа №2. Повышенный уровень. Вариант 7
// По координатам трёх точек вычислить площадь треугольника(через определитель)

#include <iostream> // Подключение библиотеки ввода-вывода

int main() { // Точка входа
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	double x1 = 0;
	double y1 = 0;
	double x2 = 0;
	double y2 = 0;
	double x3 = 0;
	double y3 = 0;
	double S = 0;

		//Ввод координат первой точки
	//Ввод координаты x1
	std::cout << "=== Координаты 1 точки треугольника ===" << std::endl;
	std::cout << "Введите координату x: ";
	std::cin >> x1;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите рациональное число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> x1;
	}
	//Ввод координаты y1
	std::cout << "Введите координату y: ";
	std::cin >> y1;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите рациональное число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> y1;
	}

	//Ввод координат второй точки
//Ввод координаты x2
	std::cout << "=== Координаты 2 точки треугольника ===" << std::endl;
	std::cout << "Введите координату x: ";
	std::cin >> x2;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите рациональное число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> x2;
	}
	//Ввод координаты y2
	std::cout << "Введите координату y: ";
	std::cin >> y2;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите рациональное число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> y2;
	}

	//Ввод координат третьей точки
//Ввод координаты x3
	std::cout << "=== Координаты 3 точки треугольника ===" << std::endl;
	std::cout << "Введите координату x: ";
	std::cin >> x3;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите рациональное число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> x3;
	}
	//Ввод координаты y3
	std::cout << "Введите координату y: ";
	std::cin >> y3;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите рациональное число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> y3;
	}
	
	
	//Подсчёт и вывод результата
	S = abs((x2 - x1) * (y3 - y1) - (x3 - x1) * (y2 - y1)) / 2;
	if (S == 0) {
		std::cout << "Все точки расположены на 1 прямой!";
	}
	else {
		std::cout << "Площадь треугольника равна " << S;
	}
	return 0; //Успешное завершение
}
