// Лабораторная работа №2. Базовый уровень. Вариант 7
// Найти остаток от деления a на b

#include <iostream> // Подключение библиотеки ввода-вывода

int main() { // Точка входа
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	int a = 0;
	int b = 0;

	//Ввод числа a
	std::cout << "Введите делимое a: "; 
	std::cin >> a;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите целое число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> a;
	}

	//Ввод числа b
	std::cout << "Введите делитель b: ";
	std::cin >> b;
	while (std::cin.fail() || b == 0) { //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите целое число не равное нулю: "; //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> b;
	}

	//Вывод результата
	std::cout << "Остаток от деления числа a на число b равен " << a % b;
	return 0; //Успешное завершение
}
