// Лабораторная работа №2. Средний уровень. Вариант 7
// По цене товара и скидке в % вычислить итоговую цену

#include <iostream> // Подключение библиотеки ввода-вывода

int main() { // Точка входа
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	double price = 0.0;
	int percent = 0;

	//Ввод цены
	std::cout << "Введите цену: ";
	std::cin >> price;
	while (std::cin.fail() || price<=0) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите положительное число: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> price;
	}

	//Ввод числа процентов
	std::cout << "Введите процент скидки: ";
	std::cin >> percent;
	while (std::cin.fail() || percent > 100 || percent < 0) { //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите число от 0 до 100: "; //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> percent;
	}

	//Вывод результата
	std::cout << "Итоговая цена с учётом скидки составляет " << price * (100 - percent) / 100;
	return 0; //Успешное завершение
}
