// Лабораторная работа №4. Базовый уровень. Вариант 7
// По коду цвета (1-4) вывести: 1-Красный, 2-Зелёный, 3-Синий, 4 - Жёлтый

#include <iostream> // Подключение библиотеки ввода-вывода

using namespace std;

int main() {
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	int Code = 0;

	//Ввод числа 
	cout << "Введите код(1-4): ";
	cin >> Code;
	while (cin.fail() || Code <= 0 || Code >= 5) {  //Цикл с проверкой на корректный ввод
		cout << "Ошибка ввода! Введите число от 1 до 4: ";  //Предупреждение об ошибке
		cin.clear(); //Сброс флага ошибки
		cin.ignore(numeric_limits<streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		cin >> Code;
	}

	switch (Code) { //Проход по switch: каждый case - отдельный вариант
		case 1:
			cout << "Красный";
			break;
		case 2:
			cout << "Зелёный";
			break;
		case 3:
			cout << "Синий";
			break;
		default:
			cout << "Жёлтый";
			break;
	}

	return 0; //Успешное завершение
}
