// Лабораторная работа №4. Средний уровень. Вариант 7
// По номеру месяца вывести количество дней в месяце (с учётом февраля — 28 / 29, год запросить отдельно)

#include <iostream> // Подключение библиотеки ввода-вывода
#include <limits> //Подключение библиотеки для лимитов

using namespace std;

int main() {
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	int month = 0;
	int answer = 0;


	//Ввод месяца
	cout << "Введите номер месяца: ";
	cin >> month;
	while (cin.fail() || month <= 0 || month >= 13) {  //Цикл с проверкой на корректный ввод
		cout << "Ошибка ввода! Введите номер месяца: ";  //Предупреждение об ошибке
		cin.clear(); //Сброс флага ошибки
		cin.ignore(numeric_limits<streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		cin >> month;
	}

	switch (month) { //Проход по switch: группировка case
		case 1:
		case 3:
		case 5:
		case 7:
		case 8:
		case 10:
		case 12:
			cout << "В этом месяце 31 день";
			break;
		case 2:
			cout << "Ваш год высокосный? 1(да)/0(нет)";

			//Проверка на высокосность
			cin >> answer;
			while (cin.fail() || answer < 0 || answer > 1) {  //Цикл с проверкой на корректный ввод
				cout << "Ошибка ввода!";  //Предупреждение об ошибке
				cin.clear(); //Сброс флага ошибки
				cin.ignore(numeric_limits<streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
				cin >> answer;
			}
			if (answer == 1) {
				cout << "В этом месяце 29 дней";
			}
			else {
				cout << "В этом месяце 28 дней";
			}
			break;
		default:
			cout << "В этом месяце 30 дней";
			break;
	}

	return 0; //Успешное завершение
}
