// Лабораторная работа №3. Повышенный уровень. Вариант 7
// Определение знака зодиака: запросить день и месяц
// рождения.Вывести знак зодиака и его описание.Полная
// проверка корректности даты(учёт дней в месяцах, февраль
// до 29)

#include <iostream> // Подключение библиотеки ввода-вывода

using namespace std;

int main() {
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	int month = 0;
	int day = 0;

	//Ввод месяца
	cout << "Введите номер месяца, в который вы родились: ";
	cin >> month;
	while (std::cin.fail() || month <= 0 || month >= 13) {  //Цикл с проверкой на корректный ввод
		cout << "Ошибка ввода! Введите номер месяца: ";  //Предупреждение об ошибке
		cin.clear(); //Сброс флага ошибки
		cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		cin >> month;
	}
	
	//Условие проверки месяца
	if (month == 1 || month == 3 || month == 5 || month == 7 || month == 8 || month == 10 || month == 12) {
		//Ввод дня
		cout << "Введите день, в который вы родились: ";
		cin >> day;
		while (std::cin.fail() || not(day >= 1 && day <= 31)) {  //Цикл с проверкой на корректный ввод
			cout << "Ошибка ввода! Введите день: ";  //Предупреждение об ошибке
			cin.clear(); //Сброс флага ошибки
			cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
			cin >> day;
		}
	}
	else if (month == 2) {
		//Ввод дня
		cout << "Введите день, в который вы родились: ";
		cin >> day;
		while (std::cin.fail() || not(day >= 1 && day <= 29)) {  //Цикл с проверкой на корректный ввод
			cout << "Ошибка ввода! Введите день: ";  //Предупреждение об ошибке
			cin.clear(); //Сброс флага ошибки
			cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
			cin >> day;
		}
	}
	else {
		//Ввод дня
		cout << "Введите день, в который вы родились: ";
		cin >> day;
		while (std::cin.fail() || not(day >= 1 && day <= 30)) {  //Цикл с проверкой на корректный ввод
			cout << "Ошибка ввода! Введите день: ";  //Предупреждение об ошибке
			cin.clear(); //Сброс флага ошибки
			cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
			cin >> day;
		}
	}
	
	//Полная проверка для результата
	if (month == 1) {
		if (day <= 20) {
			cout << "Ваш знак зодиака: Козерог";
		}
		else {
			cout << "Ваш знак зодиака: Водолей";
		}
	}
	else if (month == 2) {
		if (day <= 20) {
			cout << "Ваш знак зодиака: Водолей";
		}
		else {
			cout << "Ваш знак зодиака: Рыбы";
		}
	}
	else if (month == 3) {
		if (day <= 20) {
			cout << "Ваш знак зодиака: Рыбы";
		}
		else {
			cout << "Ваш знак зодиака: Овен";
		}
	}
	else if (month == 4) {
		if (day <= 20) {
			cout << "Ваш знак зодиака: Овен";
		}
		else {
			cout << "Ваш знак зодиака: Телец";
		}
	}
	else if (month == 5) {
		if (day <= 20) {
			cout << "Ваш знак зодиака: Телец";
		}
		else {
			cout << "Ваш знак зодиака: Близнецы";
		}
	}
	else if (month == 6) {
		if (day <= 21) {
			cout << "Ваш знак зодиака: Близнецы";
		}
		else {
			cout << "Ваш знак зодиака: Рак";
		}
	}
	else if (month == 7) {
		if (day <= 22) {
			cout << "Ваш знак зодиака: Рак";
		}
		else {
			cout << "Ваш знак зодиака: Лев";
		}
	}
	else if (month == 8) {
		if (day <= 23) {
			cout << "Ваш знак зодиака: Лев";
		}
		else {
			cout << "Ваш знак зодиака: Дева";
		}
	}
	else if (month == 9) {
		if (day <= 23) {
			cout << "Ваш знак зодиака: Дева";
		}
		else {
			cout << "Ваш знак зодиака: Весы";
		}
	}
	else if (month == 10) {
		if (day <= 23) {
			cout << "Ваш знак зодиака: Весы";
		}
		else {
			cout << "Ваш знак зодиака: Скорпион";
		}
	}
	else if (month == 11) {
		if (day <= 22) {
			cout << "Ваш знак зодиака: Скорпион";
		}
		else {
			cout << "Ваш знак зодиака: Стрелец";
		}
	}
	else if (month == 12) {
		if (day <= 21) {
			cout << "Ваш знак зодиака: Стрелец";
		}
		else {
			cout << "Ваш знак зодиака: Козерог";
		}
	}

	return 0; // Успешное завершение
}
