// Лабораторная работа №3. Базовый уровень. Вариант 7
// Запросить число. Если оно больше нуля, вывести его квадрат, иначе вывести "Некорректный ввод"

#include <iostream> // Подключение библиотеки ввода-вывода

using namespace std;

int main() {
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	double a = 0.0;

	//Ввод числа a
	cout << "Введите число больше нуля: ";
	cin >> a;
	while (std::cin.fail()) {  //Цикл с проверкой на корректный ввод
		std::cout << "Ошибка ввода! Введите число больше: ";  //Предупреждение об ошибке
		std::cin.clear(); //Сброс флага ошибки
		std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		std::cin >> a;
	}

	//Проверка числа на корректность
	if (a <= 0) {
		cout << "Некорректный ввод"; //Вывод ошибки
	}
	else {
		cout << "Квадрат числа: " << a*a; //Вывод результата
	}

	return 0; //Успешное заверешние
}
