// Лабораторная работа №3. Средний уровень. Вариант 7
// Запросить год. Определить, является ли он високосным(делится на 4, но не на 100, или делится на 400)

#include <iostream> // Подключение библиотеки ввода-вывода

using namespace std;

int main() {
	setlocale(LC_ALL, "RU"); // Функция для отображения кириллицы

	//Объявление переменных
	int a = 0;

	//Ввод числа a
	cout << "Введите целое число больше нуля: ";
	cin >> a;
	while (std::cin.fail() || a <= 0) {  //Цикл с проверкой на корректный ввод
		cout << "Ошибка ввода! Введите число больше нуля: ";  //Предупреждение об ошибке
		cin.clear(); //Сброс флага ошибки
		cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); //Выбрасываем содержание из буфера
		cin >> a;
	}

	//Проверка условия
	if ((a % 4 == 0 and a % 100 != 0) || a % 400 == 0) {
		cout << a << " год является високосным"; //Вывод результата
	}
	else {
		cout << a << " год не является високосным"; //Вывод результата
	}

	return 0; //Успешное заверешние
}
